Ran Plan for 5 projects:

1. project: `bootstrap-prod` dir: `terraform/bootstrap` workspace: `default`
1. project: `rds-prod` dir: `terraform/rds` workspace: `default`
1. project: `logging-prod` dir: `terraform/logging` workspace: `default`
1. project: `acm-prod` dir: `terraform/acm` workspace: `default`
1. project: `ecr-fileflow-prod` dir: `terraform/ecr/fileflow` workspace: `default`
---

### 1. project: `bootstrap-prod` dir: `terraform/bootstrap` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.aws_caller_identity.current: Reading...
data.aws_iam_openid_connect_provider.github: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_iam_openid_connect_provider.github: Read complete after 1s [id=arn:aws:iam::646886795421:oidc-provider/token.actions.githubusercontent.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_dynamodb_table.terraform-lock will be created
+ resource "aws_dynamodb_table" "terraform-lock" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "prod-connectly-tf-lock"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Component"   = "dynamodb"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-connectly-tf-lock"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
      + tags_all         = {
          + "Component"   = "dynamodb"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-connectly-tf-lock"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_iam_policy.github-actions-fileflow will be created
+ resource "aws_iam_policy" "github-actions-fileflow" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Permissions for deploying FileFlow infrastructure"
      + id               = (known after apply)
      + name             = "GitHubActionsFileFlowPolicy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "elasticache:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ElastiCacheManagement"
                    },
                  + {
                      + Action   = [
                          + "logs:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "CloudWatchLogsManagement"
                    },
                  + {
                      + Action   = [
                          + "s3:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "S3Management"
                    },
                  + {
                      + Action   = [
                          + "sqs:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "SQSManagement"
                    },
                  + {
                      + Action   = [
                          + "ecs:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ECSManagement"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ALBManagement"
                    },
                  + {
                      + Action   = [
                          + "ec2:*SecurityGroup*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "SecurityGroupManagement"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Component"   = "ci-cd"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "github-actions-fileflow-policy"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
      + tags_all         = {
          + "Component"   = "ci-cd"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "github-actions-fileflow-policy"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
    }

  # aws_iam_role.github-actions will be created
+ resource "aws_iam_role" "github-actions" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = [
                                  + "repo:ryu-qqq/Infrastructure:*",
                                  + "repo:ryu-qqq/fileflow:*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::646886795421:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for GitHub Actions workflows to deploy infrastructure"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GitHubActionsRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "ci-cd"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "github-actions-role"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
      + tags_all              = {
          + "Component"   = "ci-cd"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "github-actions-role"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.github-actions-kms will be created
+ resource "aws_iam_role_policy" "github-actions-kms" {
      + id          = (known after apply)
      + name        = "kms-key-access"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.github-actions-resource-management will be created
+ resource "aws_iam_role_policy" "github-actions-resource-management" {
      + id          = (known after apply)
      + name        = "resource-management"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:Describe*",
                          + "ec2:Get*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "EC2ReadOnly"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateVpc",
                          + "ec2:DeleteVpc",
                          + "ec2:ModifyVpcAttribute",
                          + "ec2:CreateSubnet",
                          + "ec2:DeleteSubnet",
                          + "ec2:CreateInternetGateway",
                          + "ec2:DeleteInternetGateway",
                          + "ec2:AttachInternetGateway",
                          + "ec2:DetachInternetGateway",
                          + "ec2:CreateRouteTable",
                          + "ec2:DeleteRouteTable",
                          + "ec2:CreateRoute",
                          + "ec2:DeleteRoute",
                          + "ec2:AssociateRouteTable",
                          + "ec2:DisassociateRouteTable",
                          + "ec2:CreateNatGateway",
                          + "ec2:DeleteNatGateway",
                          + "ec2:AllocateAddress",
                          + "ec2:ReleaseAddress",
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "VPCManagement"
                    },
                  + {
                      + Action   = [
                          + "kms:CreateKey",
                          + "kms:CreateAlias",
                          + "kms:DeleteAlias",
                          + "kms:UpdateAlias",
                          + "kms:EnableKeyRotation",
                          + "kms:DisableKeyRotation",
                          + "kms:GetKeyRotationStatus",
                          + "kms:GetKeyPolicy",
                          + "kms:PutKeyPolicy",
                          + "kms:ScheduleKeyDeletion",
                          + "kms:CancelKeyDeletion",
                          + "kms:TagResource",
                          + "kms:UntagResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "KMSManagement"
                    },
                  + {
                      + Action   = [
                          + "iam:GetRole",
                          + "iam:GetRolePolicy",
                          + "iam:GetPolicy",
                          + "iam:GetPolicyVersion",
                          + "iam:ListRolePolicies",
                          + "iam:ListAttachedRolePolicies",
                          + "iam:ListPolicyVersions",
                          + "iam:ListInstanceProfilesForRole",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "IAMReadOnly"
                    },
                  + {
                      + Action   = [
                          + "iam:CreateRole",
                          + "iam:DeleteRole",
                          + "iam:UpdateRole",
                          + "iam:PutRolePolicy",
                          + "iam:DeleteRolePolicy",
                          + "iam:AttachRolePolicy",
                          + "iam:DetachRolePolicy",
                          + "iam:TagRole",
                          + "iam:UntagRole",
                          + "iam:PassRole",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::646886795421:role/atlantis-*",
                          + "arn:aws:iam::646886795421:role/*-ecs-*",
                          + "arn:aws:iam::646886795421:role/*-execution-role",
                          + "arn:aws:iam::646886795421:role/*-task-role",
                        ]
                      + Sid      = "IAMManagement"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.github-actions-ssm will be created
+ resource "aws_iam_role_policy" "github-actions-ssm" {
      + id          = (known after apply)
      + name        = "ssm-parameter-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameter",
                          + "ssm:GetParameters",
                          + "ssm:PutParameter",
                          + "ssm:DeleteParameter",
                          + "ssm:AddTagsToResource",
                          + "ssm:ListTagsForResource",
                          + "ssm:RemoveTagsFromResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:ap-northeast-2:646886795421:parameter/shared/*"
                      + Sid      = "SSMParameterAccess"
                    },
                  + {
                      + Action   = [
                          + "ssm:DescribeParameters",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "SSMDescribe"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.github-actions-terraform-state will be created
+ resource "aws_iam_role_policy" "github-actions-terraform-state" {
      + id          = (known after apply)
      + name        = "terraform-state-access"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.github-actions-fileflow will be created
+ resource "aws_iam_role_policy_attachment" "github-actions-fileflow" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "GitHubActionsRole"
    }

  # aws_kms_alias.terraform-state will be created
+ resource "aws_kms_alias" "terraform-state" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/terraform-state"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.terraform-state will be created
+ resource "aws_kms_key" "terraform-state" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "KMS key for Terraform state encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-state-encryption"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
      + tags_all                           = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-state-encryption"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
    }

  # aws_s3_bucket.terraform-state will be created
+ resource "aws_s3_bucket" "terraform-state" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "prod-connectly"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Component"   = "s3"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-connectly"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
      + tags_all                    = {
          + "Component"   = "s3"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-connectly"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.terraform-state will be created
+ resource "aws_s3_bucket_lifecycle_configuration" "terraform-state" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "expire-old-versions"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + filter {
                # (1 unchanged attribute hidden)
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 90
            }
        }
      + rule {
          + id     = "delete-incomplete-multipart-uploads"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 7
            }

          + filter {
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_policy.terraform-state will be created
+ resource "aws_s3_bucket_policy" "terraform-state" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.terraform-state will be created
+ resource "aws_s3_bucket_public_access_block" "terraform-state" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.terraform-state will be created
+ resource "aws_s3_bucket_server_side_encryption_configuration" "terraform-state" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_s3_bucket_versioning.terraform-state will be created
+ resource "aws_s3_bucket_versioning" "terraform-state" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ dynamodb_table_arn       = (known after apply)
+ dynamodb_table_name      = "prod-connectly-tf-lock"
+ github_actions_role_arn  = (known after apply)
+ github_actions_role_name = "GitHubActionsRole"
+ kms_key_alias            = "alias/terraform-state"
+ kms_key_arn              = (known after apply)
+ kms_key_id               = (known after apply)
+ s3_bucket_arn            = (known after apply)
+ s3_bucket_name           = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p bootstrap-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FInfrastructure%252Fterraform%252Fbootstrap%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p bootstrap-prod
  ```
Plan: 16 to add, 0 to change, 0 to destroy.

---
### 2. project: `rds-prod` dir: `terraform/rds` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.cpu-utilization[0] will be updated in-place
~ resource "aws_cloudwatch_metric_alarm" "cpu-utilization" {
        id                                    = "prod-shared-mysql-cpu-utilization"
      ~ tags                                  = {
            "CostCenter"  = "engineering"
            "DataClass"   = "sensitive"
            "Description" = "Shared MySQL database for multiple services"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "Terraform"
            "Name"        = "prod-shared-mysql-cpu-alarm"
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            "Project"     = "shared-infrastructure"
            "Service"     = "shared-database"
            "Stack"       = "rds"
            "Team"        = "platform-team"
        }
      ~ tags_all                              = {
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            # (11 unchanged elements hidden)
        }
        # (22 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.database-connections[0] will be updated in-place
~ resource "aws_cloudwatch_metric_alarm" "database-connections" {
        id                                    = "prod-shared-mysql-database-connections"
      ~ tags                                  = {
            "CostCenter"  = "engineering"
            "DataClass"   = "sensitive"
            "Description" = "Shared MySQL database for multiple services"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "Terraform"
            "Name"        = "prod-shared-mysql-connections-alarm"
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            "Project"     = "shared-infrastructure"
            "Service"     = "shared-database"
            "Stack"       = "rds"
            "Team"        = "platform-team"
        }
      ~ tags_all                              = {
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            # (11 unchanged elements hidden)
        }
        # (22 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.free-storage-space[0] will be updated in-place
~ resource "aws_cloudwatch_metric_alarm" "free-storage-space" {
        id                                    = "prod-shared-mysql-free-storage-space"
      ~ tags                                  = {
            "CostCenter"  = "engineering"
            "DataClass"   = "sensitive"
            "Description" = "Shared MySQL database for multiple services"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "Terraform"
            "Name"        = "prod-shared-mysql-storage-alarm"
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            "Project"     = "shared-infrastructure"
            "Service"     = "shared-database"
            "Stack"       = "rds"
            "Team"        = "platform-team"
        }
      ~ tags_all                              = {
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            # (11 unchanged elements hidden)
        }
        # (22 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.freeable-memory[0] will be updated in-place
~ resource "aws_cloudwatch_metric_alarm" "freeable-memory" {
        id                                    = "prod-shared-mysql-freeable-memory"
      ~ tags                                  = {
            "CostCenter"  = "engineering"
            "DataClass"   = "sensitive"
            "Description" = "Shared MySQL database for multiple services"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "Terraform"
            "Name"        = "prod-shared-mysql-memory-alarm"
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            "Project"     = "shared-infrastructure"
            "Service"     = "shared-database"
            "Stack"       = "rds"
            "Team"        = "platform-team"
        }
      ~ tags_all                              = {
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            # (11 unchanged elements hidden)
        }
        # (22 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.read-latency[0] will be updated in-place
~ resource "aws_cloudwatch_metric_alarm" "read-latency" {
        id                                    = "prod-shared-mysql-read-latency"
      ~ tags                                  = {
            "CostCenter"  = "engineering"
            "DataClass"   = "sensitive"
            "Description" = "Shared MySQL database for multiple services"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "Terraform"
            "Name"        = "prod-shared-mysql-read-latency-alarm"
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            "Project"     = "shared-infrastructure"
            "Service"     = "shared-database"
            "Stack"       = "rds"
            "Team"        = "platform-team"
        }
      ~ tags_all                              = {
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            # (11 unchanged elements hidden)
        }
        # (22 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.write-latency[0] will be updated in-place
~ resource "aws_cloudwatch_metric_alarm" "write-latency" {
        id                                    = "prod-shared-mysql-write-latency"
      ~ tags                                  = {
            "CostCenter"  = "engineering"
            "DataClass"   = "sensitive"
            "Description" = "Shared MySQL database for multiple services"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "Terraform"
            "Name"        = "prod-shared-mysql-write-latency-alarm"
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            "Project"     = "shared-infrastructure"
            "Service"     = "shared-database"
            "Stack"       = "rds"
            "Team"        = "platform-team"
        }
      ~ tags_all                              = {
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            # (11 unchanged elements hidden)
        }
        # (22 unchanged attributes hidden)
    }

  # aws_db_instance.main will be updated in-place
~ resource "aws_db_instance" "main" {
        id                                    = "db-4YI333LTEWMUU3GBWYCGFL35LY"
      ~ tags                                  = {
            "CostCenter"  = "engineering"
            "DataClass"   = "sensitive"
            "Description" = "Shared MySQL database for multiple services"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "Terraform"
            "Name"        = "prod-shared-mysql"
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            "Project"     = "shared-infrastructure"
            "Service"     = "shared-database"
            "Stack"       = "rds"
            "Team"        = "platform-team"
        }
      ~ tags_all                              = {
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            # (11 unchanged elements hidden)
        }
        # (72 unchanged attributes hidden)
    }

  # aws_db_parameter_group.main will be updated in-place
~ resource "aws_db_parameter_group" "main" {
        id           = "prod-shared-mysql-params"
        name         = "prod-shared-mysql-params"
      ~ tags         = {
            "CostCenter"  = "engineering"
            "DataClass"   = "sensitive"
            "Description" = "Shared MySQL database for multiple services"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "Terraform"
            "Name"        = "prod-shared-mysql-params"
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            "Project"     = "shared-infrastructure"
            "Service"     = "shared-database"
            "Stack"       = "rds"
            "Team"        = "platform-team"
        }
      ~ tags_all     = {
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            # (11 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

      - parameter {
          - apply_method = "pending-reboot" -> null
          - name         = "innodb_buffer_pool_size" -> null
          - value        = "{DBInstanceClassMemory*3/4}" -> null
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "innodb_buffer_pool_size"
          + value        = "{DBInstanceClassMemory*3/4}"
        }

        # (6 unchanged blocks hidden)
    }

  # aws_db_subnet_group.main will be updated in-place
~ resource "aws_db_subnet_group" "main" {
        id                      = "prod-shared-mysql-subnet-group"
        name                    = "prod-shared-mysql-subnet-group"
      ~ tags                    = {
            "CostCenter"  = "engineering"
            "DataClass"   = "sensitive"
            "Description" = "Shared MySQL database for multiple services"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "Terraform"
            "Name"        = "prod-shared-mysql-subnet-group"
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            "Project"     = "shared-infrastructure"
            "Service"     = "shared-database"
            "Stack"       = "rds"
            "Team"        = "platform-team"
        }
      ~ tags_all                = {
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            # (11 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_role.rds-monitoring[0] will be updated in-place
~ resource "aws_iam_role" "rds-monitoring" {
        id                    = "prod-shared-mysql-monitoring-role"
        name                  = "prod-shared-mysql-monitoring-role"
      ~ tags                  = {
            "CostCenter"  = "engineering"
            "DataClass"   = "sensitive"
            "Description" = "Shared MySQL database for multiple services"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "Terraform"
            "Name"        = "prod-shared-mysql-monitoring-role"
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            "Project"     = "shared-infrastructure"
            "Service"     = "shared-database"
            "Stack"       = "rds"
            "Team"        = "platform-team"
        }
      ~ tags_all              = {
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            # (11 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.db-master-password will be updated in-place
~ resource "aws_secretsmanager_secret" "db-master-password" {
        id                             = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:prod-shared-mysql-master-password-OvqFrT"
        name                           = "prod-shared-mysql-master-password"
      ~ tags                           = {
            "CostCenter"  = "engineering"
            "DataClass"   = "sensitive"
            "Description" = "Shared MySQL database for multiple services"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "Terraform"
            "Name"        = "prod-shared-mysql-master-password"
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            "Project"     = "shared-infrastructure"
            "Service"     = "shared-database"
            "Stack"       = "rds"
            "Team"        = "platform-team"
        }
      ~ tags_all                       = {
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            # (11 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # aws_security_group.rds will be updated in-place
~ resource "aws_security_group" "rds" {
        id                     = "sg-0d9b6f65239b16b44"
        name                   = "prod-shared-mysql-sg"
      ~ tags                   = {
            "CostCenter"  = "engineering"
            "DataClass"   = "sensitive"
            "Description" = "Shared MySQL database for multiple services"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "Terraform"
            "Name"        = "prod-shared-mysql-sg"
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            "Project"     = "shared-infrastructure"
            "Service"     = "shared-database"
            "Stack"       = "rds"
            "Team"        = "platform-team"
        }
      ~ tags_all               = {
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            # (11 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # aws_ssm_parameter.db-instance-address will be updated in-place
~ resource "aws_ssm_parameter" "db-instance-address" {
        id              = "/shared/rds/db-instance-address"
        name            = "/shared/rds/db-instance-address"
      ~ tags            = {
            "Component"   = "rds"
            "CostCenter"  = "engineering"
            "DataClass"   = "sensitive"
            "Description" = "Shared MySQL database for multiple services"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "Terraform"
            "Name"        = "db-instance-address-export"
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            "Project"     = "shared-infrastructure"
            "Service"     = "shared-database"
            "Stack"       = "rds"
            "Team"        = "platform-team"
        }
      ~ tags_all        = {
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            # (12 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # aws_ssm_parameter.db-instance-id will be updated in-place
~ resource "aws_ssm_parameter" "db-instance-id" {
        id              = "/shared/rds/db-instance-id"
        name            = "/shared/rds/db-instance-id"
      ~ tags            = {
            "Component"   = "rds"
            "CostCenter"  = "engineering"
            "DataClass"   = "sensitive"
            "Description" = "Shared MySQL database for multiple services"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "Terraform"
            "Name"        = "db-instance-id-export"
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            "Project"     = "shared-infrastructure"
            "Service"     = "shared-database"
            "Stack"       = "rds"
            "Team"        = "platform-team"
        }
      ~ tags_all        = {
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            # (12 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # aws_ssm_parameter.db-instance-port will be updated in-place
~ resource "aws_ssm_parameter" "db-instance-port" {
        id              = "/shared/rds/db-instance-port"
        name            = "/shared/rds/db-instance-port"
      ~ tags            = {
            "Component"   = "rds"
            "CostCenter"  = "engineering"
            "DataClass"   = "sensitive"
            "Description" = "Shared MySQL database for multiple services"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "Terraform"
            "Name"        = "db-instance-port-export"
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            "Project"     = "shared-infrastructure"
            "Service"     = "shared-database"
            "Stack"       = "rds"
            "Team"        = "platform-team"
        }
      ~ tags_all        = {
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            # (12 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # aws_ssm_parameter.db-security-group-id will be updated in-place
~ resource "aws_ssm_parameter" "db-security-group-id" {
        id              = "/shared/rds/db-security-group-id"
        name            = "/shared/rds/db-security-group-id"
      ~ tags            = {
            "Component"   = "rds"
            "CostCenter"  = "engineering"
            "DataClass"   = "sensitive"
            "Description" = "Shared MySQL database for multiple services"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "Terraform"
            "Name"        = "db-security-group-id-export"
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            "Project"     = "shared-infrastructure"
            "Service"     = "shared-database"
            "Stack"       = "rds"
            "Team"        = "platform-team"
        }
      ~ tags_all        = {
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            # (12 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # aws_ssm_parameter.master-password-secret-name will be updated in-place
~ resource "aws_ssm_parameter" "master-password-secret-name" {
        id              = "/shared/rds/master-password-secret-name"
        name            = "/shared/rds/master-password-secret-name"
      ~ tags            = {
            "Component"   = "rds"
            "CostCenter"  = "engineering"
            "DataClass"   = "sensitive"
            "Description" = "Shared MySQL database for multiple services"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "Terraform"
            "Name"        = "master-password-secret-name-export"
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            "Project"     = "shared-infrastructure"
            "Service"     = "shared-database"
            "Stack"       = "rds"
            "Team"        = "platform-team"
        }
      ~ tags_all        = {
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            # (12 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # aws_vpc_security_group_egress_rule.all will be updated in-place
~ resource "aws_vpc_security_group_egress_rule" "all" {
        id                     = "sgr-09756b8e85b286d49"
      ~ tags                   = {
            "CostCenter"  = "engineering"
            "DataClass"   = "sensitive"
            "Description" = "Shared MySQL database for multiple services"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "Terraform"
            "Name"        = "prod-shared-mysql-egress-all"
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            "Project"     = "shared-infrastructure"
            "Service"     = "shared-database"
            "Stack"       = "rds"
            "Team"        = "platform-team"
        }
      ~ tags_all               = {
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            # (11 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # aws_vpc_security_group_ingress_rule.from-cidr-blocks[0] will be updated in-place
~ resource "aws_vpc_security_group_ingress_rule" "from-cidr-blocks" {
        id                     = "sgr-05af179806701f425"
      ~ tags                   = {
            "CostCenter"  = "engineering"
            "DataClass"   = "sensitive"
            "Description" = "Shared MySQL database for multiple services"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "Terraform"
            "Name"        = "prod-shared-mysql-ingress-cidr-1"
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            "Project"     = "shared-infrastructure"
            "Service"     = "shared-database"
            "Stack"       = "rds"
            "Team"        = "platform-team"
        }
      ~ tags_all               = {
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            # (11 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

Plan: 0 to add, 19 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p rds-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FInfrastructure%252Fterraform%252Frds%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p rds-prod
  ```
Plan: 0 to add, 19 to change, 0 to destroy.

---
### 3. project: `logging-prod` dir: `terraform/logging` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 init -input=false -upgrade" in "/home/atlantis/.atlantis/repos/ryu-qqq/Infrastructure/67/default/terraform/logging": exit status 1

Initializing the backend...
Upgrading modules...
- atlantis_application_logs in ../modules/cloudwatch-log-group
- atlantis_error_logs in ../modules/cloudwatch-log-group
- secrets_rotation_logs in ../modules/cloudwatch-log-group
╷
│ Error: Failed to get existing workspaces: Unable to list objects in S3 bucket "terraform-state-bucket" with prefix "env:/": operation error S3: ListObjectsV2, https response error StatusCode: 301, RequestID: D27GVCAET0G0SNMV, HostID: H/pRk9knpnNJblypUg2ot/TaEycaICEP1XRY2erEslVLu94sqVz/pGYOH/hVuKH+2L/HWXr5W+s3uK8nKa0ylvdnXmsEOSvI, requested bucket from "ap-northeast-2", actual location "us-east-1"
│ 
│ 
╵


```
</details>

---
### 4. project: `acm-prod` dir: `terraform/acm` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/Infrastructure/67/default/terraform/acm/acm-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/Infrastructure/67/default/terraform/acm": exit status 1
data.aws_route53_zone.primary: Reading...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_acm_certificate.wildcard will be created
  + resource "aws_acm_certificate" "wildcard" {
      + arn                       = (known after apply)
      + domain_name               = "set-of.com"
      + domain_validation_options = [
          + {
              + domain_name           = "*.set-of.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "set-of.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.set-of.com",
          + "set-of.com",
        ]
      + tags                      = {
          + "Component"   = "acm"
          + "CostCenter"  = "infrastructure"
          + "Domain"      = "set-of.com"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "acm-wildcard-set-of.com"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "certificate-management"
          + "Team"        = "platform-team"
          + "Type"        = "wildcard"
        }
      + tags_all                  = {
          + "Component"   = "acm"
          + "CostCenter"  = "infrastructure"
          + "Domain"      = "set-of.com"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "acm-wildcard-set-of.com"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "certificate-management"
          + "Team"        = "platform-team"
          + "Type"        = "wildcard"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_cloudwatch_metric_alarm.certificate-expiration[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "certificate-expiration" {
      + actions_enabled                       = true
      + alarm_description                     = "ACM certificate for set-of.com is expiring in less than 30 days"
      + alarm_name                            = "acm-certificate-expiration-set-of.com"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "days-to-expiry"
      + namespace                             = "AWS/CertificateManager"
      + period                                = 86400
      + statistic                             = "Minimum"
      + tags                                  = {
          + "Component"   = "monitoring"
          + "CostCenter"  = "infrastructure"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "alarm-acm-expiration-set-of.com"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "certificate-management"
          + "Team"        = "platform-team"
        }
      + tags_all                              = {
          + "Component"   = "monitoring"
          + "CostCenter"  = "infrastructure"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "alarm-acm-expiration-set-of.com"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "certificate-management"
          + "Team"        = "platform-team"
        }
      + threshold                             = 30
      + treat_missing_data                    = "notBreaching"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + certificate_arn                       = (known after apply)
  + certificate_domain_name               = "set-of.com"
  + certificate_id                        = (known after apply)
  + certificate_not_after                 = (known after apply)
  + certificate_not_before                = (known after apply)
  + certificate_status                    = (known after apply)
  + certificate_subject_alternative_names = [
      + "*.set-of.com",
      + "set-of.com",
    ]
  + certificate_validation_method         = "DNS"
  + expiration_alarm_arn                  = (known after apply)
╷
│ Error: reading Route 53 Hosted Zones: operation error Route 53: ListHostedZones, https response error StatusCode: 403, RequestID: 6e824276-2e3c-4541-b4cc-341540bfb412, api error AccessDenied: User: arn:aws:sts::646886795421:assumed-role/atlantis-ecs-task-prod/8a4c791b5aa64e46b51324c99db77545 is not authorized to perform: route53:ListHostedZones because no identity-based policy allows the route53:ListHostedZones action
│ 
│   with data.aws_route53_zone.primary,
│   on main.tf line 106, in data "aws_route53_zone" "primary":
│  106: data "aws_route53_zone" "primary" {
│ 
╵

```
</details>

---
### 5. project: `ecr-fileflow-prod` dir: `terraform/ecr/fileflow` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # aws_ecr_repository.fileflow will be updated in-place
~ resource "aws_ecr_repository" "fileflow" {
        id                   = "fileflow"
        name                 = "fileflow"
      ~ tags                 = {
            "Component"   = "container-registry"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "Name"        = "ecr-fileflow"
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            "Service"     = "fileflow"
        }
      ~ tags_all             = {
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            # (9 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ssm_parameter.fileflow-repository-url will be updated in-place
~ resource "aws_ssm_parameter" "fileflow-repository-url" {
        id              = "/shared/ecr/fileflow-repository-url"
        name            = "/shared/ecr/fileflow-repository-url"
      ~ tags            = {
            "Component"   = "ecr"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "Name"        = "fileflow-ecr-repository-url-export"
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            "Service"     = "fileflow"
        }
      ~ tags_all        = {
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            # (9 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p ecr-fileflow-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FInfrastructure%252Fterraform%252Fecr%252Ffileflow%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p ecr-fileflow-prod
  ```
Plan: 0 to add, 2 to change, 0 to destroy.

---
### Plan Summary

5 projects, 3 with changes, 0 with no changes, 2 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```